Aerodynamics/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
79729
(
(-31.1635 -0.897009 -0.178042)
(-31.2757 -0.918295 -0.186987)
(-31.1469 -0.474202 -0.400486)
(-31.435 -0.9757 -0.20439)
(-31.2551 -0.476391 -0.422566)
(-31.121 -0.203105 -0.282927)
(-31.0824 -0.160087 -0.720697)
(-31.7384 -1.16136 -0.270568)
...
)
;

boundaryField
{
    front
    {
        type            symmetryPlane;
    }
    back
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (-30 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    lowerWall
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            symmetryPlane;
    }
    aircraftModel
    {
        type            noSlip;
    }
}


// ************************************************************************* //
