Aerodynamics/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
79729
(
-452.802
-453.834
-453.256
-455.819
-454.514
-453.904
-453.746
-459.346
...
)
;

boundaryField
{
    front
    {
        type            symmetryPlane;
    }
    back
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            totalPressure;
        rho             none;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           nonuniform List<scalar> 
940
(
-449.094
-447.993
-450.099
-449.613
-449.17
-449.44
-447.404
-449.807
...
)
;
    }
    lowerWall
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            symmetryPlane;
    }
    aircraftModel
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
