Aerodynamics/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
246185
(
0.00548453
-0.000200484
-0.00547173
0.000187672
0.00550039
-0.00020896
0.000193098
0.0134345
...
)
;

boundaryField
{
    front
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    back
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 45;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
940
(
-11.2193
-11.2026
-11.2612
-2.86794
-2.81002
-2.81078
-2.80429
-11.2484
...
)
;
    }
    lowerWall
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    upperWall
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    aircraftModel
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
