Aerodynamics/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

//z is vertical position
vertices
(
    (-20 -6 -4)
    (3 -6 -4)
    (3 6 -4)
    (-20 6 -4)

    (-20 -6 4)
    (3 -6 4)
    (3 6 4)
    (-20 6 4)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 8 8) simpleGrading (1 1 1)
);

edges
(
);


boundary
(
    front
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }
    back
    {
        type symmetryPlane;
        faces
        (
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type symmetryPlane;
        faces
        (
            (4 5 6 7)
        );
    }


);

// ************************************************************************* //
