Aerodynamics/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

forces
{
    type            forceCoeffs;
    libs            ("libforces.so");
    writeControl    timeStep;
    writeInterval   1;

    patches         aircraftModelGroup
    rho             rhoInf;      // Indicates incompressible
    log             true;
    rhoInf          1;           // Redundant for incompressible
    liftDir         (0 0 1);
    dragDir         (-1 0 0);
    pitchAxis       (0 1 0);
    magUInf         20;
}


// ************************************************************************* //
